## PANDA INTRODUCTION 
* Derived from panel data 
* pd 
* dataframe = a table and stores data
*

In [75]:
import pandas as pd

### Create a python dictionary with values and convert to a pandas dataframe

In [76]:
data = {"oranges" : [5,6,7,4,5], "apples" : [2,5,4,6,3], "bananas" : [6,8,9,1,3]}

In [77]:
data

{'oranges': [5, 6, 7, 4, 5],
 'apples': [2, 5, 4, 6, 3],
 'bananas': [6, 8, 9, 1, 3]}

In [78]:
df1 = pd.DataFrame(data)

In [79]:
df1

   oranges  apples  bananas
0        5       2        6
1        6       5        8
2        7       4        9
3        4       6        1
4        5       3        3

In [80]:
# change the no index to custom name index
df1 = pd.DataFrame(data, index=["Molly", "Jack", "Lisa", "Sally", "Melli"])

In [81]:
df1

       oranges  apples  bananas
Molly        5       2        6
Jack         6       5        8
Lisa         7       4        9
Sally        4       6        1
Melli        5       3        3

In [82]:
type(df1)

pandas.core.frame.DataFrame

### Different ways to access a dataframe object column

In [83]:
df1['apples']

Molly    2
Jack     5
Lisa     4
Sally    6
Melli    3
Name: apples, dtype: int64

In [84]:
# safest to use
a = df1['apples']
type(a)

pandas.core.series.Series

In [85]:
# not recommended because it is placed between inbuilt methods. 
o = df1.oranges
o

Molly    5
Jack     6
Lisa     7
Sally    4
Melli    5
Name: oranges, dtype: int64

In [86]:
type(o)

pandas.core.series.Series

### Explore inbuilt methods in both Dataframe and series

In [87]:
df1.columns

Index(['oranges', 'apples', 'bananas'], dtype='object')

In [88]:
c = df1.columns
type(c)

pandas.core.indexes.base.Index

In [89]:
c[0]

'oranges'

In [90]:
c1 = list (c)
type(c1)

list

In [91]:
c1

['oranges', 'apples', 'bananas']

In [92]:
# change apple to lemon 
df1.rename({'apples':'lemons'}, axis='columns')
# this doesnt change from memory

       oranges  lemons  bananas
Molly        5       2        6
Jack         6       5        8
Lisa         7       4        9
Sally        4       6        1
Melli        5       3        3

In [93]:
# change in memory 
# inplace changes argument = replaces the original memory storage. 
df1.rename({'apples':'lemons'}, axis='columns', inplace=True)

In [94]:
df1

       oranges  lemons  bananas
Molly        5       2        6
Jack         6       5        8
Lisa         7       4        9
Sally        4       6        1
Melli        5       3        3

### Methods that are there is a dataframe not a series

In [95]:
o = df1["oranges"]

In [96]:
type(o)

pandas.core.series.Series

In [97]:
o.Jack

6

In [99]:
df1.loc['Lisa', ['oranges', 'bananas']]

oranges    7
bananas    9
Name: Lisa, dtype: int64